In [1]:
# SQL is a declarative programing language ,our focus is what we want we do not care about how to get it 
# SQL is a DATABASE domain specific language 
# SQL divide into 3 parts DML,DDl,DCL
# MySQl is a relational database
# It contains data in tables
# Each table related to one each other 

# query the sql commands in jupyter notebook by connecting mysql server using mysql connector 
import mysql.connector
import pandas as pd

In [2]:
connection=mysql.connector.connect(host='localhost'
                                  ,user='root'
                                  ,passwd='jani@123'
                                  ,db='imdb')

In [3]:
connection

In [4]:
# running the sql commands using pndas
# pd.read_sql_query(query,connection)

# To know the what are tables in data base
# SHOW TABLES

imdb_tables=pd.read_sql_query('SHOW TABLES',connection)
imdb_tables

     Tables_in_imdb
0            actors
1         directors
2  directors_genres
3            movies
4  movies_directors
5     movies_genres
6             roles

with the help of pandas we create dataframe of tables

Note : Now we can manipulate this dataframe using pandas

In [5]:
# If you want to know what are the fields present in each table 
# DESCRIBE ====> it describes the fields in particulat tables
# pd.read_sql_query('DESCRIBE table name ',connection)

Fields=pd.read_sql_query('DESCRIBE movies',connection)

In [6]:
Fields

       Field          Type Null  Key  Default Extra
0         id           int   NO  PRI      0.0
1       name  varchar(100)  YES  MUL      NaN
2       year           int  YES           NaN
3  rankscore         float  YES           NaN

In the above dataframe we have type that is data type ===> int(interger),varchar(variable charcter string ),float

Key:PRI ====> Primary key uniquely identify the rows ,its belong to single table 
forigen key ====> it may present in other tables also 

MUL===> Multiple values

In [7]:
# If you want list the all  movies in the table then we SELECT() command
# SELECT * =====> all coumns in a table 

Selecting=pd.read_sql_query('SELECT * FROM movies',connection)

In [8]:
print(Selecting)

            id                                 name  year  rankscore
0            0                                  #28  2002        NaN
1            1  #7 Train: An Immigrant Journey, The  2000        NaN
2            2                                    $  1971        6.4
3            3                        $1,000 Reward  1913        NaN
4            4                        $1,000 Reward  1915        NaN
...        ...                                  ...   ...        ...
388264  412316                      "zem blch krlu"  1991        NaN
388265  412317                             "rgammk"  1995        NaN
388266  412318                         "zgnm Leyla"  2002        NaN
388267  412319                          " Istanbul"  1983        NaN
388268  412320                          "sterreich"  1958        NaN

[388269 rows x 4 columns]

In [9]:
# if you want to only name ,rankscore 
# SELECT name,rankscore from movies

Name_Rankscore=pd.read_sql_query('SELECT name,rankscore FROM movies',connection)

In [10]:
print(Name_Rankscore)

                                       name  rankscore
0                                       #28        NaN
1       #7 Train: An Immigrant Journey, The        NaN
2                                         $        6.4
3                             $1,000 Reward        NaN
4                             $1,000 Reward        NaN
...                                     ...        ...
388264                      "zem blch krlu"        NaN
388265                             "rgammk"        NaN
388266                         "zgnm Leyla"        NaN
388267                          " Istanbul"        NaN
388268                          "sterreich"        NaN

[388269 rows x 2 columns]

Note: No need to select column in a order which are in the table we can select in any manner

In [11]:
# In the above we have 388269 rows if you want only 10 rows then we use LIMIT
# LIMIT number

Top_rows=pd.read_sql_query('SELECT name,rankscore FROM movies LIMIT 10',connection)

In [12]:
print(Top_rows)

                                  name  rankscore
0                                  #28        NaN
1  #7 Train: An Immigrant Journey, The        NaN
2                                    $        6.4
3                        $1,000 Reward        NaN
4                        $1,000 Reward        NaN
5                        $1,000 Reward        NaN
6                      $1,000,000 Duck        5.0
7               $1,000,000 Reward, The        NaN
8               $10,000 Under a Pillow        NaN
9                             $100,000        NaN

In [13]:
# If you want to ignore top 10 rows and want to 10 movies after that

Offset_rows=pd.read_sql_query('SELECT name,rankscore FROM movies LIMIT 10 OFFSET 10',connection)

In [14]:
print(Offset_rows)

                     name  rankscore
0   $100,000 Pyramid, The        NaN
1       $1000 a Touchdown        6.7
2      $20,000 Carat, The        NaN
3  $21 a Day Once a Month        NaN
4        $2500 Bride, The        NaN
5                     $30        7.5
6                 $30,000        NaN
7          $300 y tickets        NaN
8                 $40,000        9.6
9           $5,000 Reward        NaN

In [15]:
Offset_rows1=pd.read_sql_query('SELECT name,rankscore FROM movies LIMIT 10 OFFSET 20',connection)

In [16]:
print(Offset_rows1)

                                  name  rankscore
0  $5,000,000 Counterfeiting Plot, The        NaN
1                            $5.15/Hr.        NaN
2             $5.20 an Hour Dream, The        NaN
3               $50,000 Challenge, The        NaN
4             $50,000 Climax Show, The        2.6
5             $50,000 Jewel Theft, The        NaN
6                       $50,000 Reward        NaN
7                     $500 Reward, The        NaN
8                      $500,000 Reward        NaN
9                                $pent        4.3

In [17]:
# If you want movies which are high rankscore in decending order we use ORDER BY

# SELECT name,rankscore FROM movies ORDER BY rankscore DESC LIMIT 10

High_rankscore= pd.read_sql_query('SELECT name,rankscore FROM movies ORDER BY rankscore DESC LIMIT 10',connection)

In [18]:
print(High_rankscore)

                                      name  rankscore
0  Atunci i-am condamnat pe toti la moarte        9.9
1                       Dawn of the Friend        9.9
2                        Distinto amanecer        9.9
3                        Duminica la ora 6        9.9
4                    Complex Sessions, The        9.9
5                                 Blow Job        9.9
6                                Duck Soup        9.9
7                      Devil's Circus, The        9.9
8                            Clearing, The        9.9
9                                    Dosti        9.9

In [19]:
Movies_genre=pd.read_sql_query('SELECT genre FROM movies_genres',connection)

In [20]:
print(Movies_genre)

              genre
0       Documentary
1             Short
2            Comedy
3             Crime
4           Western
...             ...
395114    Adventure
395115        Drama
395116       Comedy
395117        Drama
395118       Comedy

[395119 rows x 1 columns]

In [21]:
# in the above we have comedy ,drama mulltiple times 
# if we want distinct(unique) genere we use DISTINCT

Distinct_genre=pd.read_sql_query('SELECT DISTINCT genre FROM movies_genres',connection)

In [22]:
print(Distinct_genre)

          genre
0   Documentary
1         Short
2        Comedy
3         Crime
4       Western
5        Family
6     Animation
7         Drama
8       Romance
9       Mystery
10     Thriller
11        Adult
12        Music
13       Action
14      Fantasy
15       Sci-Fi
16       Horror
17          War
18      Musical
19    Adventure
20    Film-Noir

Using Distinct we get unique genres in the movies_genres table

In [23]:
Distinct_names=pd.read_sql_query('SELECT DISTINCT first_name FROM directors ',connection)

In [24]:
print(Distinct_names)

           first_name
0             'Chico'
1      'Philthy' Phil
2          'Weird Al'
3                  A.
4              A. (I)
...               ...
23268          Øyvind
23269        Þór Elís
23270       Þorsteinn
23271       Þorvaldur
23272          Þráinn

[23273 rows x 1 columns]

In [25]:
Distinct_names=pd.read_sql_query('SELECT DISTINCT first_name FROM directors ORDER BY first_name',connection)

In [26]:
print(Distinct_names)

           first_name
0             'Chico'
1      'Philthy' Phil
2          'Weird Al'
3                  A.
4              A. (I)
...               ...
23268          Øyvind
23269        Þór Elís
23270       Þorsteinn
23271       Þorvaldur
23272          Þráinn

[23273 rows x 1 columns]

In [27]:
# using WHERE 
# if you want movies with rankscore>9

Rankscore=pd.read_sql_query('SELECT name,rankscore FROM movies WHERE rankscore>9 ORDER BY rankscore DESC LIMIT 10',connection)

In [28]:
print(Rankscore)

                                      name  rankscore
0                                 Blow Job        9.9
1                        Duminica la ora 6        9.9
2                    Complex Sessions, The        9.9
3                      Devil's Circus, The        9.9
4                                Duck Soup        9.9
5  Atunci i-am condamnat pe toti la moarte        9.9
6                                    Dosti        9.9
7                       Dawn of the Friend        9.9
8                        Distinto amanecer        9.9
9                            Clearing, The        9.9

In [29]:
# get the particular genre movie using comparission operator
# =,>=,<=,!=

Comedy_movies=pd.read_sql_query('SELECT * FROM movies_genres WHERE genre="comedy"',connection)

In [30]:
print(Comedy_movies)

       movie_id   genre
0             2  Comedy
1             6  Comedy
2             8  Comedy
3            11  Comedy
4            15  Comedy
...         ...     ...
56420    378583  Comedy
56421    378594  Comedy
56422    378597  Comedy
56423    378613  Comedy
56424    378614  Comedy

[56425 rows x 2 columns]

In [31]:
# If you want null values in column we use IS NULL
# IS NULL

Without_rank=pd.read_sql_query('SELECT name,rankscore FROM movies WHERE rankscore IS NULL LIMIT 20',connection)

In [32]:
print(Without_rank)

                                   name rankscore
0                                   #28      None
1   #7 Train: An Immigrant Journey, The      None
2                         $1,000 Reward      None
3                         $1,000 Reward      None
4                         $1,000 Reward      None
5                $1,000,000 Reward, The      None
6                $10,000 Under a Pillow      None
7                              $100,000      None
8                 $100,000 Pyramid, The      None
9                    $20,000 Carat, The      None
10               $21 a Day Once a Month      None
11                     $2500 Bride, The      None
12                              $30,000      None
13                       $300 y tickets      None
14                        $5,000 Reward      None
15  $5,000,000 Counterfeiting Plot, The      None
16                            $5.15/Hr.      None
17             $5.20 an Hour Dream, The      None
18               $50,000 Challenge, The      None
19             $50,000 Jewel Theft, The      None

Note = rankscore=NULL doesn't work so we use IS NULL

In [33]:
# using logical operators 
# AND,OR,NOT,ALL,ANY,BETWEEN,EXISTS,IN,LIKE,SOME

Latest_hitmovies=pd.read_sql_query('SELECT name,year,rankscore FROM movies WHERE rankscore>9 AND year>2001',connection)

In [34]:
print(Latest_hitmovies)

                  name  year  rankscore
0         12 (2003/II)  2003        9.8
1    14 Million Dreams  2003        9.5
2                  2+1  2004        9.2
3            2wks, 1yr  2002        9.4
4          5 Card Stud  2002        9.4
..                 ...   ...        ...
207         White Bits  2002        9.2
208      White Like Me  2004        9.4
209            Yes and  2004        9.3
210     Ziel:gerichtet  2003        9.6
211              Zonad  2003        9.4

[212 rows x 3 columns]

In [35]:
Latest_hitmovies=pd.read_sql_query('SELECT name,year,rankscore FROM movies WHERE rankscore>9 OR year>2001',connection)

In [36]:
print(Latest_hitmovies)

                 name  year  rankscore
0                 #28  2002        NaN
1      $300 y tickets  2002        NaN
2             $40,000  1996        9.6
3           $5.15/Hr.  2004        NaN
4             $windle  2002        5.4
...               ...   ...        ...
35168  " i havet, En"  2003        NaN
35169    "ppna dagar"  2003        NaN
35170          "rnen"  2004        NaN
35171    "pa el nimo"  2002        NaN
35172    "zgnm Leyla"  2002        NaN

[35173 rows x 3 columns]

In [37]:
# if you want movies in between 1999 and 2000
# BETWEEN upper AND lower

Between=pd.read_sql_query('SELECT name,year FROM movies WHERE year BETWEEN 2000 AND 2003',connection)

In [38]:
print(Between)

                                      name  year
0                                      #28  2002
1      #7 Train: An Immigrant Journey, The  2000
2                    $100,000 Pyramid, The  2001
3                           $300 y tickets  2002
4                                    $pent  2000
...                                    ...   ...
47274             "le de la tentation, L'"  2002
47275                       " i havet, En"  2003
47276                         "ppna dagar"  2003
47277                         "pa el nimo"  2002
47278                         "zgnm Leyla"  2002

[47279 rows x 2 columns]

Note: While using between upper and lower limits  upper value always less than lowervalue

In [39]:
# using IN
# IN(" cat1 "," cat2")

IN=pd.read_sql_query('SELECT director_id,genre FROM directors_genres WHERE genre IN("comedy","horror") LIMIT 10',connection)

In [40]:
print(IN)

   director_id   genre
0            8  Comedy
1           10  Comedy
2           12  Comedy
3           18  Comedy
4           22  Comedy
5           23  Horror
6           31  Comedy
7           37  Comedy
8           41  Comedy
9           42  Comedy

In [41]:
# Using LIKE
# LIKE' %'    
# % is a wild card character ===> it imply zero or more characters

LIKE=pd.read_sql_query('SELECT name,year FROM movies WHERE name LIKE "ja%"',connection)

In [42]:
print(LIKE)

                             name  year
0        Ja alla oli tulinen jrvi  1937
1           Ja alussa oli puhe...  1993
2        Ja byl sputnikom solntsa  1959
3             Ja ga zovem sloboda  1963
4                         Ja gore  1967
...                           ...   ...
1761                Jazztime Tale  1992
1762                    Jazzwomen  2000
1763           Jazzy Janitor, The  1920
1764  Jazzyfatnastees: In Process  2002
1765             Ja me maaten...!  2000

[1766 rows x 2 columns]

In [43]:
LIKE=pd.read_sql_query('SELECT name,year FROM movies WHERE name LIKE "sa_n"',connection)

In [44]:
print(LIKE)

   name  year
0  Sain  1963
1  Sarn  1968

Note: % and _ are wild card characters 
     '_' used for single character only
     '%' used for zero (or)multiple characters

Exceptional cases: 
    
    case1: if any column contalin percentage values like 96% 76% etc at that time % consider as wild card character
            to overcome this we use '\'(escape character)
            Ex: SELECT * FROM table WHERE percentage='96\%'
                
    case2: if any column contain names or text like n_guru@gmail.com in this case _ consider as wild card character to overcome
                 this we use'\'
            Ex: SELECT * FROM table WHERE name="n\_guru@gmail.com"

## Aggregate functions : MIN,MAX,SUM,AVG,COUNT

In [45]:
# MIN =====> it return the minmum of the column 
MIN=pd.read_sql_query('SELECT MIN(year) FROM movies',connection)

In [46]:
print(MIN)

   MIN(year)
0       1888

In [47]:
# MAX ==> it returns the maximumn of the column
MAX=pd.read_sql_query('SELECT MAX(year) FROM movies',connection)

In [48]:
print(MAX)

   MAX(year)
0       2008

In [49]:
# AVG =====> it return the average of the column 
AVG=pd.read_sql_query('SELECT AVG(year) FROM movies',connection)

In [50]:
print(AVG)

   AVG(year)
0  1969.7883

In [51]:
# COUNT =====> it returns the number of rows in year column
COUNT=pd.read_sql_query('SELECT COUNT(year) FROM movies',connection)

In [52]:
print(COUNT)

   COUNT(year)
0       388269

In [53]:
# COUNT ====>
COUNT=pd.read_sql_query('SELECT COUNT(*) FROM movies WHERE year >2000',connection)

In [54]:
print(COUNT)

   COUNT(*)
0     46006

## GROUP BY

In [55]:
# GROUP BY =======> it group the rows
GROUP=pd.read_sql_query('SELECT year,COUNT(year) FROM movies GROUP BY year',connection)

In [56]:
print(GROUP)

     year  COUNT(year)
0    2002        12056
1    2000        11643
2    1971         4072
3    1913         3690
4    1915         3722
..    ...          ...
115  2007            7
116  1891            6
117  2008            1
118  1890            3
119  1888            2

[120 rows x 2 columns]

In [57]:
# both GROUP BY and ORDER BY 
GROUP_ORDER= pd.read_sql_query('SELECT year,COUNT(year) FROM movies GROUP BY year ORDER BY year',connection)

In [58]:
print(GROUP_ORDER)

     year  COUNT(year)
0    1888            2
1    1890            3
2    1891            6
3    1892            9
4    1893            2
..    ...          ...
115  2004         8718
116  2005         1449
117  2006          195
118  2007            7
119  2008            1

[120 rows x 2 columns]

In [59]:
# Creating new variable which is alias of column 

ALIAS= pd.read_sql_query('SELECT year,COUNT(year) year_count FROM movies GROUP BY year ORDER BY year_count',connection)

In [60]:
print(ALIAS)

     year  year_count
0    2008           1
1    1893           2
2    1888           2
3    1890           3
4    1891           6
..    ...         ...
115  1999       10976
116  2000       11643
117  2001       11690
118  2003       11890
119  2002       12056

[120 rows x 2 columns]

Note : year_count is an alias , we are creating new variable which is eqaul to COUNT(year)

Note : If grouping columns contains NULL values all NULL values are grouped together

## HAVING

In [61]:
HAVING= pd.read_sql_query("SELECT year,COUNT(year) year_count FROM movies GROUP BY year HAVING year_count>1000",connection)

In [62]:
print(HAVING)

    year  year_count
0   2002       12056
1   2000       11643
2   1971        4072
3   1913        3690
4   1915        3722
..   ...         ...
92  1945        1557
93  1928        2051
94  1936        2355
95  1953        2549
96  1926        2137

[97 rows x 2 columns]

NOTE : exuction 1 group by 2 aggeregate 3 having

In [63]:
HAVING1= pd.read_sql_query("SELECT name,year FROM movies HAVING year>2000",connection)

In [64]:
print(HAVING1)

                        name  year
0                        #28  2002
1      $100,000 Pyramid, The  2001
2             $300 y tickets  2002
3                  $5.15/Hr.  2004
4                    $windle  2002
...                      ...   ...
46001         " i havet, En"  2003
46002           "ppna dagar"  2003
46003                 "rnen"  2004
46004           "pa el nimo"  2002
46005           "zgnm Leyla"  2002

[46006 rows x 2 columns]

In [65]:
HAVING2= pd.read_sql_query("SELECT name,year FROM movies WHERE year>2000",connection)

In [66]:
print(HAVING2)

                        name  year
0                        #28  2002
1      $100,000 Pyramid, The  2001
2             $300 y tickets  2002
3                  $5.15/Hr.  2004
4                    $windle  2002
...                      ...   ...
46001         " i havet, En"  2003
46002           "ppna dagar"  2003
46003                 "rnen"  2004
46004           "pa el nimo"  2002
46005           "zgnm Leyla"  2002

[46006 rows x 2 columns]

NOTE : In the both cases without group by gives the same result

NOTE : HAVING with GROUP BY same as WHERE

Thumb of rule: When we have group by we use HAVING when we don't have  group by we better to use WHERE

In [67]:
HAVING_=pd.read_sql_query("SELECT year,COUNT(year) year_count FROM movies WHERE rankscore >9 GROUP BY year HAVING year_count>20",connection)

In [68]:
print(HAVING_)

   year  year_count
0  1996          34
1  2003          87
2  2004          48
3  2002          77
4  2000          45
5  1999          33
6  1982          24
7  2001          38
8  1997          23
9  1998          21

Note : above excution 1 WHERE 2 GROUP BY 3 AGGREGATION 4 HAVING

Note1: WHERE is applied on individual rows while HAVING is applied on groups

Note2: HAVING is applied after grouping while WHERE is used before grouping

## JOIN's : Natural join,Inner join, left join,right join,outer join

In [69]:
# INNER JOIN

Inner=pd.read_sql_query('SELECT m.name,g.genre from movies m JOIN movies_genres g ON m.ID=g.movie_ID LIMIT 20',connection)

In [70]:
print(Inner)

                                   name        genre
0   #7 Train: An Immigrant Journey, The  Documentary
1   #7 Train: An Immigrant Journey, The        Short
2                                     $       Comedy
3                                     $        Crime
4                         $1,000 Reward      Western
5                       $1,000,000 Duck       Comedy
6                       $1,000,000 Duck       Family
7                $10,000 Under a Pillow    Animation
8                $10,000 Under a Pillow       Comedy
9                $10,000 Under a Pillow        Short
10                             $100,000        Drama
11                $100,000 Pyramid, The       Family
12                    $1000 a Touchdown       Comedy
13                   $20,000 Carat, The        Crime
14                   $20,000 Carat, The        Drama
15                   $20,000 Carat, The        Short
16               $21 a Day Once a Month    Animation
17               $21 a Day Once a Month        Short
18                     $2500 Bride, The        Drama
19                     $2500 Bride, The      Romance

In [71]:
# NATURAL JOIN  ====> join where we have the same column names

NATURAL = pd.read_sql_query('SELECT * FROM movies JOIN movies_genres LIMIT 10',connection)

In [72]:
print(NATURAL)

   id name  year rankscore  movie_id        genre
0   0  #28  2002      None         1  Documentary
1   0  #28  2002      None         1        Short
2   0  #28  2002      None         2       Comedy
3   0  #28  2002      None         2        Crime
4   0  #28  2002      None         5      Western
5   0  #28  2002      None         6       Comedy
6   0  #28  2002      None         6       Family
7   0  #28  2002      None         8    Animation
8   0  #28  2002      None         8       Comedy
9   0  #28  2002      None         8        Short

In [73]:
# LEFT OUTER JOIN  ====> prefer LEFT table

LEFT= pd.read_sql_query('SELECT * FROM movies m LEFT OUTER JOIN movies_genres g on m.ID=g.movie_ID LIMIT 10',connection)

In [74]:
print(LEFT)

   id                                 name  year  rankscore  movie_id  \
0   0                                  #28  2002        NaN       NaN
1   1  #7 Train: An Immigrant Journey, The  2000        NaN       1.0
2   1  #7 Train: An Immigrant Journey, The  2000        NaN       1.0
3   2                                    $  1971        6.4       2.0
4   2                                    $  1971        6.4       2.0
5   3                        $1,000 Reward  1913        NaN       NaN
6   4                        $1,000 Reward  1915        NaN       NaN
7   5                        $1,000 Reward  1923        NaN       5.0
8   6                      $1,000,000 Duck  1971        5.0       6.0
9   6                      $1,000,000 Duck  1971        5.0       6.0

         genre
0         None
1  Documentary
2        Short
3       Comedy
4        Crime
5         None
6         None
7      Western
8       Comedy
9       Family

In [75]:
# RIGHT OUTER JOIN ====> prefer RIGHT table

RIGHT=pd.read_sql_query('SELECT * FROM movies m RIGHT OUTER JOIN movies_genres g ON m.ID=g.movie_ID LIMIT 10',connection)

In [76]:
print(RIGHT)

   id                                 name  year  rankscore  movie_id  \
0   1  #7 Train: An Immigrant Journey, The  2000        NaN         1
1   1  #7 Train: An Immigrant Journey, The  2000        NaN         1
2   2                                    $  1971        6.4         2
3   2                                    $  1971        6.4         2
4   5                        $1,000 Reward  1923        NaN         5
5   6                      $1,000,000 Duck  1971        5.0         6
6   6                      $1,000,000 Duck  1971        5.0         6
7   8               $10,000 Under a Pillow  1921        NaN         8
8   8               $10,000 Under a Pillow  1921        NaN         8
9   8               $10,000 Under a Pillow  1921        NaN         8

         genre
0  Documentary
1        Short
2       Comedy
3        Crime
4      Western
5       Comedy
6       Family
7    Animation
8       Comedy
9        Short

In [77]:
# Three way join  ======> three tables joining

Three= pd.read_sql_query('SELECT a.first_name,a.last_name FROM actors a JOIN roles r ON a.ID=r.actor_ID JOIN movies m ON m.ID=r.movie_ID AND m.name LIMIT 10',connection)

In [78]:
print(Three)

  first_name last_name
0     Oswald       'Ô'
1     Oswald       'Ô'
2     Oswald       'Ô'
3     Oswald       'Ô'
4     Oswald       'Ô'
5       Mode         2
6      André      3000
7      André      3000
8      André      3000
9      André      3000

Interpretation : T1 inner join T2 =====> T result 
                 T inner join T3  =====> T* result
                first_name and last_name form T*

## SUBQUERIES/NESTED QUERIES/INNER QUERIES

In [79]:
# Above three way join can be done with sub queries 

SUB_QUERIE= pd.read_sql_query('SELECT * FROM movies WHERE rankscore >= ALL(SELECT MAX(rankscore) FROM movies)',connection)

In [80]:
print(SUB_QUERIE)

        id                                     name  year  rankscore
0    23608  Atunci i-am condamnat pe toti la moarte  1971        9.9
1    41537                                 Blow Job  2002        9.9
2    65522                            Clearing, The  2001        9.9
3    68770                    Complex Sessions, The  1994        9.9
4    79678                       Dawn of the Friend  2004        9.9
5    84983                      Devil's Circus, The  1926        9.9
6    87894                        Distinto amanecer  1943        9.9
7    91477                                    Dosti  1964        9.9
8    94558                                Duck Soup  1942        9.9
9    95123                        Duminica la ora 6  1965        9.9
10  125616               Genet parle d'Angela Davis  1970        9.9
11  131247                           Gong fu qi jie  1979        9.9
12  145429                                   Himala  1982        9.9
13  153301                                   Huttyn  1996        9.9
14  163898                         Ivan Groznyj III  1988        9.9
15  171541                                Jnos vitz  1973        9.9
16  205227           Marche des femmes  Hendaye, La  1975        9.9
17  227596                        Napolon Bonaparte  1934        9.9
18  230568                           New Clear Farm  1998        9.9
19  230864                           New World, The  1982        9.9
20  246768                         Pair of Boots, A  1962        9.9
21  264084                         Prince Solitaire  2003        9.9
22  266013          Prostitues de Lyon parlent, Les  1975        9.9
23  288249                                   Sargam  1995        9.9
24  289646                                 Scarmour  1997        9.9
25  289842                         Schalkse ruiters  1997        9.9
26  305294                            Slyozy kapali  1982        9.9
27  313896                        Star povesti cesk  1953        9.9
28  320483                                   Svadba  1944        9.9
29  320710                      Svoga tela gospodar  1957        9.9
30  334747                         Together & Alone  1998        9.9
31  343965              Ubijtsi vykhodyat na dorogu  1942        9.9
32  347078                 Unicorn in the Garden, A  1953        9.9
33  351405                           Velnio nuotaka  1973        9.9
34  357173                   Voynata na taralezhite  1979        9.9
35  363633                           Whirlpool, The  2003        9.9
36  368865                   Wrestling with Shadows  2000        9.9
37  372074                            You Are Not I  1981        9.9
38  372443                     Young and Restless 2  1985        9.9
39  374517                                   Zenith  2001        9.9

# DML : DATA MANUPULATION LANGUAGE

IN DML we can inesrt,update,delete the tables

INSERTING: Adding extra rows to the existing table

 EX:INSERT=pd.read_sql_query('INSERT INTO movies(ID,name,year,rankscore) VALUES(412321,"Thor",2011,7)',connection)
 
UPDATE:To update something exist in table 

EX: UPDATE movies SET rankscore=9 WHERE ID= 412321

DELETING: To delete entire row 

EX: DELETE FROM movies WHERE ID=412321

# DDL: DATA DEFINITION LANGUAGE

IN DDL we can create a table,add,modify,drop the table

Creating tabel 

EX: CREATE TABLE Language(ID INT PRIMARY,lang VARCHAR(50) NOT NULL)
               constraints : NOTNULL,UNIQUE,PRIMARY KEY,FOREIGN KEY,CHECK,DEFAULT,INDEX

ALTER: ADD,MODIFY,DROP
    
ADD: adding column to the existing table 
    
    EX: ALTER TABLE language ADD country VARCHAR(50);
        
MODIFY: To modify the length of column 
    
    EX: ALTER TABLE language MODIFY country VARCHAR(60);
        
DROP: TO drop column from the table 
    
    EX: ALTER TABLE language DROP country;
    
NOTE: DROP TABLE: it removes the both table and it's data 
      TRUNCATE TABLE: it removes the data in the table only it doesn't remove the table

## DATA CONTROL LANGUAGE :GRANT,REVOKE

DCL tells about whose has control of data 

GRANT:Allow specified users to perform specified tasks 
REVOKE: Cancel previously granted (or) denied permission